c3rebro/MSP430ProgD_PIC18F4620/MSP430 ProgD.c
/*==========================================================================*\  
|                                                                            |  
| MSP430 ProgD.c                                                             |  
|                                                                            |  
| Main programfile                                                           |  
|----------------------------------------------------------------------------|  
| Project:              MSP430 ProgD                                         | 
| Developed using:      Microchip MPLAB IDE v8.66 + HITECHC Toolchain 9.83   |  
|----------------------------------------------------------------------------|  
| Author:               STO                                                  |  
| Version:              1.6                                                  |  
| Initial Version:      04-17-02                                             |  
| Last Change:          13-13-05                                             |  
|----------------------------------------------------------------------------|  
| Version history:                                                           |  
| 1.0 04/12 STR        Initial version.                                      |   
|----------------------------------------------------------------------------|  
| Designed 2012 by Steven Rott (STR)                                         |  
\*==========================================================================*/   

#include "p18f4620.h"
#include "JTAGfunc.h"   
#include "MSP430 ProgD.h" 
#include "IO.h"
#include "LowLevelfunc.h"

// Configuration bits for PIC16f887
#pragma config OSC = INTIO67
#pragma config WDT = OFF
#pragma config PWRT = ON
#pragma config BOREN = OFF
#pragma config PBADEN = OFF
#pragma config STVREN = OFF
#pragma config XINST = OFF

#pragma code low_vector=0x18
void lowInterrupt(void)
{
    _asm GOTO rxInISR _endasm
}

// This is needed to convert the hexadecimal content of the memory to
// rom character set of the display so the user can see whats in the
// memory. This is stored in RAM...

#pragma rom codepad
    rom word codepad[2][16]=
    {   '0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F',
        0x0000,0x1000,0x2000,0x3000,0x4000,0x5000,0x6000,0x7000,0x8000,
        0x9000,0xA000,0xB000,0xC000,0xD000,0xE000,0xF000
    };
    #pragma rom

/*
#pragma rom byteCodepad
    rom byte byteCodepad[2][16]=
    {   '0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F',
        0x00,0x10,0x20,0x30,0x40,0x50,0x60,0x70,0x80,0x90,0xA0,0xB0,0xC0,0xD0,0xE0,0xF0
    };
    #pragma rom
*/
/*   the type of firmware to work with...

     the 3dimensional array 'dataLocator' contains the adresses of the needed information
     depending on the firmware version (MAR2009, JAN2012) and device type (INT_LN_R, RN_ER).

                     ___________ ________ ____________ _____________ __________                                     
                     .......    |  NETID |   SGMT-IN  |   SGMT-OUT  |   FREQ   |
                     -----------|--------|------------|-------------|--------- |                                              
                  ___________ ________ ____________ _____________ __________   |                                  
                  RN_ER(0x02)|  NETID |   SGMT-IN  |   SGMT-OUT  |   FREQ   |--|  
                  -----------|--------|------------|-------------|----------|  |                                            
            ______________ _________ ____________ _____________ _________   |--|   
            INT_LN_R(0x01)|  NETID  |   SGMT-IN  |    SGMT-OUT |   FREQ  |--|  |   
            --------------|---------|------------|-------------|---------|  |--|                      
     (0x01) MAR2009       |  0x8010 |   0x8012   |    N/A      |  N/A    |--|           
            --------------|---------|------------|-------------|---------|  |                                     
     (0x02) JAN2012       |  N/A    |   N/A      |    N/A      |  N/A    |--|   
            --------------|---------|------------|-------------|---------|                                     
     (0x03)               |         |            |             |         |      
            --------------|---------|------------|-------------|---------|                                       
            ...
*/

const word data13[4]={0x0A00,0xFF00,0x0000,0x0000};
const word data1[8]={0xA06A,0x0100,0x0008,0xF008,0xA0DA,0x0004,0x0012,0xA27E};

typedef struct{
        word net_id_adress;
        word sgmt_in_adress;
        word sgmt_out_adress;
        word freq_adress;
}device;

device int_ln_r;

#pragma rom dataLocator
    static rom word dataLocator[4][5]=			// [devicetype], [datatype]
    {   
		0,0,0,0,0,
        INT_LN_R_NETID, INT_LN_R_SGMT_IN, 0, INT_LN_R_FREQ_A, INT_LN_R_FREQ_B,     
        RN_ER_2009_NETID, RN_ER_2009_SGMT_IN, RN_ER_2009_SGMT_OUT, RN_ER_2009_FREQ_A,RN_ER_2009_FREQ_B,   
        0,0,0,0,0     
    };
    #pragma rom

// ISR for recieve

byte charcount=0;
byte length=0;
byte serialdata[8];
word adrSRAM=0x0000;

struct StatusBits {
  unsigned rx_begin:1;
  unsigned high_nibble:1;
  unsigned ready:1;
  unsigned rx_len:1;
  unsigned high_byte:1;
  unsigned rx_adress:1;
  unsigned rx_data:1;
  unsigned rx_ack:1;
} STATbits={0,1,0,0,1,0,0,0};

#pragma interruptlow rxInISR
void rxInISR(void)
{
    byte rxbuf=RCREG;

	if(!STATbits.ready)
	{
		txOut(13,0); 
		txOut(0,(rom byte*)"Device not ready yet.");
		txOut('\n',0);
		txOut(13,0); 
		txOut(0,(rom byte*)"Please start 'programming mode' first,");
		txOut('\n',0);
		txOut(13,0);
		txOut(0,(rom byte*)"by pressing '014'");
 		txOut('\n',0);
		return;
	}

/*-----------------------------------------------------------------
Recieving the bytecount from the USART...
------------------------------------------------------------------  */

	if(STATbits.rx_begin)
	{
		serialdata[charcount]=rxbuf;

		charcount++;

		if(charcount==8u)
		{
			STATbits.rx_data=TRUE;
			STATbits.rx_begin=FALSE;
			charcount=0;

			length|=ascii2hex(serialdata[0]);
			length<<=4;
			length|=ascii2hex(serialdata[1]);
	
			length+=length;

			adrSRAM|=ascii2hex(serialdata[2]);
			adrSRAM<<=4;
			adrSRAM|=ascii2hex(serialdata[3]);
			adrSRAM<<=4;
			adrSRAM|=ascii2hex(serialdata[4]);
			adrSRAM<<=4;
			adrSRAM|=ascii2hex(serialdata[5]);
		}
	}

