c3rebro/MSP430ProgD_PIC18F4620/MSP430 ProgD.c
	if(STATbits.rx_data&&length)
	{
		sramWrite(adrSRAM,rxbuf);
		length--;
		adrSRAM++;
	}

    if(rxbuf==':')
	{
        STATbits.rx_begin=TRUE;
		STATbits.rx_ack=TRUE;
		STATbits.high_nibble=TRUE;
		STATbits.rx_len=TRUE;
		length=0;
		charcount=0;
	}
}

/*---------------------------------------------------------------------------  
   This is the main routine
  
   Arguments:   
   Result:
*/

void main(void)
{
	byte i=0x03;

	byte serialData;

	byte* dataP;

	word iterA;	
	byte iterB=0;
	word adress;

	byte temp_2=0;
	byte firmwareVersion=0x00;
	word cmd;

    byte keyStroke;

	initController();

	// PORT A,B,C*,D* and E as output

    // PORTA.0 = !WR        (Display and SRAM)
    // PORTA.1 = !RD  		(Display and SRAM)
    // PORTA.2 = CS1  		(CS LCD)
    // PORTA.3 = CD 		(Command / data input of the display controller)
    // PORTA.4 = LAL   		(AdressLatch of A8..15)
    // PORTA.5 = HAL 		(AdressLatch of A0..7)
    // PORTA.6 = AEN 		(16bit Adress output enable)
    // PORTA.7 = CS2		(CS SRAM)
			
	TRISA = 0b00000000;     // used for the display and sram (bus control port)
	LATA  = 0b11001111;

	TRISB = 0b11111111;     // used as multiplexed adress/databus (for the display and the sram)

	TRISC = 0b11000001;     // *RC0 - RC5 JTAG Interface PortC.0 is TDO, RC6 UART TX, RC7 UART RX
	LATC  = 0b00111110;

    TRISD = 0b11110000;     // *used for the matrix keypad
	TRISE = 0b00000000;     // unused for now...

    // initialize the display controller, (re)start the display and
    // draw the "mainmenu-frame"		
	displayInit();

    // show me the Device is working...

	txOut(0,(rom byte*)"MSP430 ProgD v0.01");
	txOut('\n',0); txOut(13,0);

	while(1)
	{
    	switch(getWholeCommand())           // get the user command from the keyboard...
		{                                   // and switch to the corresponding (sub)menu.
			case 0x0010:
			{               //             "<   max-length    >"
				printToScreen(0,0,(rom byte*)">010: applications ",1,1);
				printToScreen(0,0,(rom byte*)">020: settings     ",1,2);
				printToScreen(0,0,(rom byte*)"                   ",1,3);
				printToScreen(0,0,(rom byte*)">030: help         ",1,4);
				printToScreen(0,0,(rom byte*)"          ",1,6);
			}break;

			case 0x0100:
			{                 //           "<   max-length    >"
				printToScreen(0,0,(rom byte*)">011: clone device ",1,1);
				printToScreen(0,0,(rom byte*)">012: read config  ",1,2);
				printToScreen(0,0,(rom byte*)">013: routersearch ",1,3);
				printToScreen(0,0,(rom byte*)">014: progr. mode  ",1,4);
				printToScreen(0,0,(rom byte*)"                   ",1,5);
				printToScreen(0,0,(rom byte*)"<001: back       ",1,6);
	
			}break;

			case 0x0110:
			{                 //           "<   max-length    >"
				printToScreen(0,0,(rom byte*)"reading FW data... ",1,1);
				printToScreen(0,0,(rom byte*)"                   ",1,2);
				printToScreen(0,0,(rom byte*)"                   ",1,3);
				printToScreen(0,0,(rom byte*)"                   ",1,4);
				printToScreen(0,0,(rom byte*)"<010: back",1,6);
				

				if(GetDevice()!=1u)
				{                //            "<   max-length    >"
					printToScreen(0,0,(rom byte*)" ERROR 0x1F!      ",1,1);
					printToScreen(0,0,(rom byte*)" INVALID JTAG-ID! ",1,2);
					printToScreen(0,0,(rom byte*)" no connection?   ",1,3);
					printToScreen(0,0,(rom byte*)"<012: retry   ",1,5);
					break;
				}

				else
				{
						msDelay(1000);
						//EraseFLASH(3,0x8000);

					    txOut('\n',0); 	txOut(13,0);
						txOut(0,(rom byte*)"here comes the data...");

						//	iterA=adrSRAM;
						adrSRAM=0x8000;
	                    txOut('\n',0); 	txOut(13,0);
						for(adrSRAM=0x8000;adrSRAM<=0x8100;adrSRAM++)
						{
							serialData=sramRead(adrSRAM);
							txOut(serialData,0);
						}

		        ReleaseDevice(V_RESET);
				}	
	
				//WriteFLASH(0x8000,8,data1);
				//WriteFLASH(0x8080,4,data13);

			}break;

			case 0x0120:
			{	
			                 //            "<   max-length    >"
				printToScreen(0,0,(rom byte*)" analysing FW ver ",1,1);
				printToScreen(0,0,(rom byte*)" please wait...   ",1,2);
				printToScreen(0,0,(rom byte*)"                  ",1,3);
				printToScreen(0,0,(rom byte*)"                  ",1,4);
				printToScreen(0,0,(rom byte*)"                  ",1,5);
				printToScreen(0,0,(rom byte*)"<010: back",1,6);
				
				if(GetDevice()!=1u)
				{                //            "<   max-length    >"
					printToScreen(0,0,(rom byte*)" ERROR 0x1F!      ",1,1);
					printToScreen(0,0,(rom byte*)" INVALID JTAG-ID! ",1,2);
					printToScreen(0,0,(rom byte*)" no connection?   ",1,3);
					printToScreen(0,0,(rom byte*)"<012: retry   ",1,5);
					break;
				}

				else
				{

					firmwareVersion=getFirmwareVersion();
                    cacheFirmware(firmwareVersion);
                    drawFirmwareInfo(firmwareVersion);

					msDelay(50);

		            ReleaseDevice(V_RESET);

				}
			}break;

			case 0x0130:
			{                //            "<   max-length    >"
				printToScreen(0,0,(rom byte*)" reading current  ",1,1);
				printToScreen(0,0,(rom byte*)" configuration... ",1,2);
				printToScreen(0,0,(rom byte*)"                  ",1,3);
				printToScreen(0,0,(rom byte*)"                  ",1,4);
				printToScreen(0,0,(rom byte*)"<010: back",1,6);


				msDelay(1000);

                cacheFirmware(INT_LN_R);
               	drawFirmwareInfo(INT_LN_R);
				

      				        //             "<   max-length    >"
   							//             "<             max-length            >"
			//	printToScreen(0,0,(rom byte*)" edit new config                     ",1,1);
			//	printToScreen(0,0,(rom byte*)"                                     ",1,2);
			//	printToScreen(0,0,(rom byte*)"                                     ",1,3);
				printToScreen(0,0,(rom byte*)" please specify new values by        ",1,8);
				printToScreen(0,0,(rom byte*)" pressing the 'E'key. Press it again ",1,9);
				printToScreen(0,0,(rom byte*)" when finished.                      ",1,10);

