c3rebro/MSP430ProgD_PIC18F4620/MSP430 ProgD.c
				while(waitForSingleKey(ASCII)!='E');
					usDelay(1000);

				keyStroke=0xFF;
				while(waitForSingleKey(ASCII)!=0xFF)
					usDelay(1000);

				for(iterA=0u; iterA<=3u; iterA++){
					display(2,15+iterA,1,0x21);		    // Cursor Pointer (x,y)
					while(keyStroke==0xFF)
						keyStroke=waitForSingleKey(ASCII);
					printToScreen(keyStroke,0,0,15+iterA,1); 
					keyStroke=0xFF;
					while(waitForSingleKey(ASCII)!=0xFF)
						usDelay(100);
				}

				for(iterB=0u; iterB<=63u; iterB++){
					temp_2=sramRead(iterB);
					temp_2>>=4;
					txOut(hex2ascii(temp_2&0x0F),0);
					txOut(hex2ascii((sramRead(iterB)&0x0F)),0);
				}

				EraseFLASH(3,0x8000);

				writeFirmware(0x8000,3);


			}break;

			case 0x0140:
			{                //            "<   max-length    >"
   							//             "<             max-length            >"
				printToScreen(0,0,(rom byte*)" You need to erase ",1,1);
				printToScreen(0,0,(rom byte*)" the target before ",1,2);
				printToScreen(0,0,(rom byte*)" you can continue. ",1,3);
				printToScreen(0,0,(rom byte*)" (E)rase. (A)bort  ",1,4);
				printToScreen(0,0,(rom byte*)"<010: back",1,6);

				txOut('\n',0);
				txOut(13,0);
				txOut(0,(rom byte*)"Device ready for ERASE...");

                while(keyStroke!=3u||4u)
                {

                    keyStroke=waitForSingleKey(ASCII);

                    if(keyStroke==4u)
                    {  
						txOut('\n',0);
						txOut(13,0);
						txOut(0,(rom byte*)"ERASING...");
/*
						if(GetDevice()!=1u)
						{                //            "<   max-length    >"
							printToScreen(0,0,(rom byte*)" ERROR 0x1F!      ",1,1);
							printToScreen(0,0,(rom byte*)" INVALID JTAG-ID! ",1,2);
							printToScreen(0,0,(rom byte*)" no connection?   ",1,3);
        					printToScreen(0,0,(rom byte*)"                  ",1,4);
							printToScreen(0,0,(rom byte*)"<014: retry   ",1,5);
							break;
						}
*/
                        printToScreen(0,0,(rom byte*)" ERASING...        ",1,1);
        				printToScreen(0,0,(rom byte*)"                   ",1,2);
        				printToScreen(0,0,(rom byte*)"                   ",1,3);
        				printToScreen(0,0,(rom byte*)"                   ",1,4);

						for(adress=0x8000;adress<=0xFE00;adress+=0x100)
						{
                     //  		EraseFLASH(3,adress);
						}

                        printToScreen(0,0,(rom byte*)" DONE...           ",1,1);
	                    
                        txOut('\n',0); 	txOut(13,0);
                        txOut(0,(rom byte*)"ready...");

						STATbits.ready=1;
						STATbits.rx_ack=FALSE;
						adrSRAM=0x0000;
						
						while(!STATbits.rx_ack)
						{
	                        printToScreen(0,0,(rom byte*)" Waiting for FW    ",1,1);
	        				printToScreen(0,0,(rom byte*)" data. Press 'F'   ",1,2);
	        				printToScreen(0,0,(rom byte*)" Button when the   ",1,3);
	        				printToScreen(0,0,(rom byte*)" transfer is done. ",1,4);
						}

                        printToScreen(0,0,(rom byte*)" receiving DATA... ",1,1);
        				printToScreen(0,0,(rom byte*)"                   ",1,2);
        				printToScreen(0,0,(rom byte*)"                   ",1,3);
        				printToScreen(0,0,(rom byte*)"                   ",1,4);

                    }

                    else if(keyStroke==3u)
					{
                        cmd=0x0100;
						txOut('\n',0);
						txOut(13,0);
						txOut(0,(rom byte*)"Transmission terminated...");

						printToScreen(0,0,(rom byte*)">010: applications ",1,1);
						printToScreen(0,0,(rom byte*)">020: settings     ",1,2);
						printToScreen(0,0,(rom byte*)"                   ",1,3);
						printToScreen(0,0,(rom byte*)">030: help         ",1,4);
						printToScreen(0,0,(rom byte*)"          ",1,6);

	                    txOut('\n',0); 	txOut(13,0);
						txOut(0,(rom byte*)"here comes the data...");

					//	iterA=adrSRAM;
						adrSRAM=0x8000;
	                    txOut('\n',0); 	txOut(13,0);
						for(adrSRAM=0x8000;adrSRAM<=0x8100;adrSRAM++)
						{
							serialData=sramRead(adrSRAM);
							txOut(serialData,0);
						}break;

					}
                }
			}break;
		}
	}
}

/*---------------------------------------------------------------------------  
   This routine is used to write data from sram to flash
  
   Arguments:   
   Result:
*/

byte writeFirmware(word startAdr, word lenght)
{
	byte flashDataByte[16];
	word* wDataP;
	word flashDataWord[8]={0,0,0,0,0,0,0,0};
	byte serialData;
	byte serialDataBackup;
	byte iterA, iterB;

	adrSRAM=0x0000;

	txOut('\n',0); 	txOut(13,0);

	for(iterB=0u; iterB<=length;iterB++){	// The data is written to the flash in lines...
		for(iterA=0u;iterA<=15u;iterA++){	// of 8 Words each.
			serialData=sramRead(adrSRAM);
			flashDataByte[iterA]=serialData;
			serialDataBackup=serialData;
			serialData>>=4;
	
			if(!(iterA%2)&&iterA)			// Print out a space char each word (rs232 debugging)
				txOut(' ',0);
	
			txOut(hex2ascii(serialData&=0x0F),0);	// Print out each Data written to flash...
			serialData=serialDataBackup;
			txOut(hex2ascii(serialData&=0x0F),0);
			
			if(!(iterA%2)){					// convert sram bytes to little endian format word
											// i.e. A6 6E -> 6EA6
				flashDataWord[iterA/2]|=serialDataBackup;	
				flashDataWord[iterA/2]<<=8;			
			}

			else{
				flashDataWord[iterA/2]|=serialDataBackup;				
			}

			adrSRAM++;
		}
		wDataP=flashDataWord;
		WriteFLASH(startAdr+(iterB*0x0010),8u,wDataP);
	}
	ReleaseDevice(V_RESET);
}


/*---------------------------------------------------------------------------  
   In the first step, here i'll try to find out which FW version i have.
   This is important as the information needed is located in an different
   location in the flash memory. The Location differs in every FW ver.

   Additionally i need to figure out whats the type of component connected
   as the Locknodes dont need two segments like the routers...
  
   Arguments: none
   Result: 0x01 means: I found a WN.RN.ER with FW of 2009
           0x02 means: I found a WN.RN.ER with FW of 2012

           0x00 means: I cannot find any known FW
   TODO:   add the different nodetypes and FW versions
*/


