c3rebro/MSP430ProgD_PIC18F4620/MSP430 ProgD.c
byte getFirmwareVersion(void)
{
	word data[6];

	word i;

	for(i=0xA200;i<0xA4FF;i+=2u)    //nothing found? maybe another FW ver!
	{
		
	
		data[0]=ReadMem(F_WORD,i);

		if(data[0]==0x7541u)
			return RN_ER_2009;

	}	

	for(i=0xEA00;i<0xEDFF;i+=2u)    //nothing found? maybe another FW ver!
	{
		
	
		data[0]=ReadMem(F_WORD,i);

		if(data[0]==0x614Au)
			return RN_ER_2012;

	}

return 0;                           //i did not found any known FW ver info segment! 
}

/*---------------------------------------------------------------------------  
    In the second step, i'll put the corresponding data segment to the
    SRAM. The data will get lost otherwise because of the need to
    erase the specific flash segment before write. The PIC18F4620 has
    4K of RAM. I use a hardware attached 64K 15ns SRAM (61512 AK)

    Arguments: 	The "Firmware Version". Which means basically the type of Device.
				Depending on this, different adress locations needed to
				be cached.

    Result: 0x01 means: a WN.RN.ER with FW of 2009
            0x02 means: a WN.RN.ER with FW of 2012
            0x30 means: the internal LN.R

            0x00 means: I cannot find any known FW
    TODO:   add the different nodetypes and FW versions
*/

byte cacheFirmware(byte fwVer)
{
	word flashDataWord=0x0000;
	word flashDataWordBackup=0x0000;
	byte flashDataByte=0x00;
	byte flashDataByteBackup=0x00;

	word adrSRAM=0x8000;
    word* ramP;
    word iterA=0x0000;
	word iterB=0x0000;

    switch (fwVer)
    {
        case RN_ER_2009:
        {
        	//ramP=firmwareData1;

        	for(adrSRAM=0x8000;adrSRAM<0x808F;adrSRAM+=2u)
        	{
        		*ramP=ReadMem(F_WORD,adrSRAM);
                ramP++;
        	}
            return STATUS_OK;
        }break;

        case RN_ER_2012:
        {
        	//ramP=firmwareData1;

        	for(adrSRAM=0x8000;adrSRAM<0x806F;adrSRAM+=2u)
        	{
        		*ramP=ReadMem(F_WORD,adrSRAM);
                ramP++;
        	}
            return STATUS_OK;
        }break;

        case INT_LN_R:
        {
        	//ramP=firmwareData1;
        	for(adrSRAM=0x8000u;adrSRAM<=0x803Fu;adrSRAM+=2u){
				flashDataWord=ReadMem(F_WORD,adrSRAM);
				flashDataWordBackup=flashDataWord;

				for(iterB=0u; iterB<=1u; iterB++){
					flashDataByteBackup|=flashDataWordBackup;
					flashDataByteBackup>>=4;
					txOut(hex2ascii(flashDataByteBackup&0x0F),0);
					txOut(hex2ascii(flashDataWordBackup&0x000F),0);
					flashDataWordBackup>>=8;
				}

				txOut(' ',0);

				flashDataByte=flashDataWord;
				flashDataWord>>=8;
        		sramWrite(iterA,flashDataByte);

				flashDataByte=flashDataWord;
        		sramWrite(iterA+1,flashDataByte);
				iterA+=2;

        	}
			
            return STATUS_OK;
        }break;

        default:
            return STATUS_ERROR;
    }
}

/*---------------------------------------------------------------------------  
    Here, the internals of the components firmware is brought to the user
    via the screen.

    Arguments:      

    Result: STATUS_ERROR (0)
            STATUS_OK (1)

    TODO:   add the different nodetypes and FW versions
*/

byte drawFirmwareInfo(byte firmwareVersion)
{
    switch (firmwareVersion)
	{
		case NOT_KNOWN:
		{
			printToScreen(0,0,(rom byte*)" ERROR 0x0F!      ",1,1);
			printToScreen(0,0,(rom byte*)" UNKOWN FW-ver!   ",1,2);
			printToScreen(0,0,(rom byte*)"<012: retry   ",1,5);

			return STATUS_ERROR;
			
		}break;

		case RN_ER_2009:
		{
		                 //            "<   max-length    >"
			printToScreen(0,0,(rom byte*)" FOUND WN.RN.XX   ",1,1);
			printToScreen(0,0,(rom byte*)" FWver 03.08.2009 ",1,2);
			printToScreen(0,0,(rom byte*)"                ",1,5);

			msDelay(5000);
		}break;

		case RN_ER_2012:
		{
		                 //            "<   max-length    >"
			printToScreen(0,0,(rom byte*)" FOUND WN.RN.XX   ",1,1);
			printToScreen(0,0,(rom byte*)" FWver 03.01.2012 ",1,2);
			printToScreen(0,0,(rom byte*)"                ",1,5);
			
			msDelay(5000);

		}break;

		case INT_LN_R:
		{
/*		                 //            "<   max-length    >"
			printToScreen(0,0,(rom byte*)" Please set the   ",1,1);
			printToScreen(0,0,(rom byte*)" NETID, SGMT and  ",1,2);
			printToScreen(0,0,(rom byte*)" Freq. and press  ",1,3);
			printToScreen(0,0,(rom byte*)" the 'E' key.     ",1,4);
			
			msDelay(3000);
*/
			cls();

			drawInputSgmt(INT_LN_R);
			drawNetID(INT_LN_R);
			drawFreq(INT_LN_R);

		}break;
	}
	return STATUS_OK;
}


/*---------------------------------------------------------------------------  
   This is the xy routine
  
   Arguments:   
   Result:
*/

void drawFreq(byte firmwareVersion){

	// the carrier freq is coded as 3 bytes in 2 words, thus the last byte in word 2
	// is not used to determine the carrier frequency. each word is little-endian and
	// must be converted to big-endian before calculating the correct carrier frequency
	// i.e. word 1 = 6E21; word 2 = 99D5 the correct register value is 216ED5 = 2191061 dec :)
	// the carrier freq for ti's c1101 is then calc with 
	// the equation 26.000.000 * 2191061 / 65536 = 869(,)256.387 (M)Hz
	
	byte byteContainer[5]={0,0,0,0,0};
    byte cntByteIter;
    byte indexCodepad;				// indexcounter for the codepad conversion hex <> ascii
	byte cntHLByteIter;
	byte cntIterForDecData=0;

	byte* data_ptr;

	word rawData[3];
    byte decodedData[10];

	dword carrierFreqReg=0;
	ufloat carrierFreq=0;

	rawData[0]=ReadMem(F_WORD,dataLocator[firmwareVersion][FREQ_A]);
	rawData[1]=ReadMem(F_WORD,dataLocator[firmwareVersion][FREQ_B]);

	byteContainer[0]|=rawData[0];		// the order of loading the byteContainer defines which byte
	rawData[0]>>=8;						// of each word is displayed and stored first
	byteContainer[1]|=rawData[0];		// important for calculating !

	byteContainer[2]|=rawData[1];
	//rawData[1]>>=8;					// no need to touch the last byte (yet)
	//byteContainer[3]|=rawData[1];

	for(cntByteIter=0; cntByteIter<3u; cntByteIter++){
		carrierFreqReg<<=8;
		carrierFreqReg|=byteContainer[cntByteIter];
	}

	switch (carrierFreqReg){

