c3rebro/MSP430ProgD_PIC18F4620/MSP430 ProgD.c
	case 0x00216ed5u:
		printToScreen(0,0,(rom byte*)"CarrierFreq: 869,2563MhZ         ",2,4);
	break;

	case 0x002165c2u:
		printToScreen(0,0,(rom byte*)"CarrierFreq: 868,3347MhZ         ",2,4);
	break;

	default:
	printToScreen(0,0,(rom byte*)"CarrierFreq: NOT FOUND         ",2,4);
	}
}

/*---------------------------------------------------------------------------  
   This is the xy routine
  
   Arguments:   
   Result:
*/

void drawInputSgmt(byte firmwareVersion){

    byte j;
    byte k;

	byte* data_ptr;

	word data[2];
    byte decodedData[9];

	data[0]=ReadMem(F_WORD,dataLocator[firmwareVersion][SEGM_IN]);//
	data[1]=data[0];

	for(j=0; j<4u; j++)
	{

		data[0]=data[1];

		data[0]&=0xF000;

		for(k=0u; k<=15u; k++)
		{
			if(codepad[1][k]==data[0])
				decodedData[j]=codepad[0][k];
		}
		
		data[1]<<=4;
	}

	decodedData[4]='\0';
			   	//             "<             max-length            >"
	printToScreen(0,0,(rom byte*)"InputSGMT:       ",2,1);
	data_ptr=decodedData;
	printToScreen(0,data_ptr,0,15,1);
}

/*---------------------------------------------------------------------------  
   This is the xy routine
  
   Arguments:   
   Result:
*/

void drawOutputSgmt(byte firmwareVersion){

    byte j;
    byte k;

	byte* data_ptr;

	word data[2];
    byte decodedData[9];

    data[0]=ReadMem(F_WORD,dataLocator[firmwareVersion][SEGM_OUT]); //0x8024
	data[1]=data[0];

	for(j=0; j<4u; j++)
	{

		data[0]=data[1];

		data[0]&=0xF000;

		for(k=0; k<=15u; k++)
		{
			if(codepad[1][k]==data[0])
				decodedData[j]=codepad[0][k];
		}
		
		data[1]<<=4;
	}

	decodedData[4]='\0';
   	//             "<             max-length            >"
	printToScreen(0,0,(rom byte*)"OutputSGMT:       ",2,2);
	data_ptr=decodedData;
	printToScreen(0,data_ptr,0,15,2);
}

/*---------------------------------------------------------------------------  
   This is the xy routine
  
   Arguments:   
   Result:
*/

void drawNetID(byte firmwareVersion){

    byte j;
    byte k;

	byte* data_ptr;

	word data[2];
    byte decodedData[9];

	data[0]=ReadMem(F_WORD,dataLocator[firmwareVersion][NETID]);//
	data[1]=data[0];

	for(j=0; j<4u; j++)
	{

		data[0]=data[1];

		data[0]&=0xF000;

		for(k=0u; k<=15u; k++)
		{
			if(codepad[1][k]==data[0])
				decodedData[j]=codepad[0][k];
		}
		
		data[1]<<=4;
	}

	decodedData[4]='\0';
			   	//             "<             max-length            >"
	printToScreen(0,0,(rom byte*)"NetID:       ",2,3);
	data_ptr=decodedData;
	printToScreen(0,data_ptr,0,15,3);
}

/*---------------------------------------------------------------------------  
   This is the xy routine
  
   Arguments:   
   Result:
*/

byte ascii2hex(byte ascii)
{
	//byte temp=ascii;

	if(ascii>=48u||ascii<=57u)
		return ascii-48;

	else if(ascii>=65u||ascii<=70u)
		return ascii-55u;

	else
		return 0;
}

/*---------------------------------------------------------------------------  
   This is the xy routine
  
   Arguments:   
   Result:
*/

byte hex2ascii(byte hex)
{
	//byte temp=ascii;

	if(hex>=0u&&hex<=9u)
		return hex+=48;

	else if(hex>=10u&&hex<=15u)
		return hex+=55;

	else
		return 0;
}

//#######################################################################################
//# REST IN PEACE 																	 	#
//# HERE REST ALL UNUSED FUNCTIONS AND 'FUNCTION PROTOTYPES' THAT ARE NO LONGER USED    #
//# OR WHICH WERE REPLACED BY BETTER SOLUTIONS                                          #
//#######################################################################################


//	carrierFreq = carrierFreqReg;
//	carrierFreq = carrierFreq / 65536 * 26000;
//	carrierFreqReg = carrierFreq;
/*
	for(cntByteIter=0; cntByteIter<3u; cntByteIter++)	// convert memory content to displayable ascii data
	{													// by using a convert table hex <--> ascii
		byteContainer[4]=byteContainer[cntByteIter];	// load byte to convert in the "working position" in array
														// "byteContainer". Each byte must be broken up in nibbles
		rawData[2]=byteContainer[4];					// same as above for the words. each word must be reviewed twice
		rawData[2]<<=8;									// for compatibility reasons convert back from byte to word
		rawData[2]&=0xF000;								// just convert upper nibble

		for(cntHLByteIter=0u; cntHLByteIter<2u; cntHLByteIter++){
			for(indexCodepad=0u; indexCodepad<=15u; indexCodepad++){
				if(codepad[1][indexCodepad]==rawData[2]){
					decodedData[cntIterForDecData]=codepad[0][indexCodepad];
					rawData[2]=byteContainer[4];		// reload the word "working register"
					rawData[2]<<=12;					// and select the lower nibble of the current byte
					cntIterForDecData++;				// next ascii char
					break;								// no need to continue searching in the codepad
				}
			}
		}
	}


	for(cntByteIter=0u; cntByteIter<6u;cntByteIter++){
		byteContainer[3]=carrierFreqReg;
		byteContainer[3]&=0x0F;
		decodedData[cntByteIter]=hex2ascii(byteContainer[3]);
		carrierFreqReg>>=4;
	}

	decodedData[6]='\0';
			   	//             "<             max-length            >"
	printToScreen(0,0,(rom byte*)"CarrierFreq:                    ",2,4);
	data_ptr=decodedData;
	printToScreen(0,data_ptr,0,15,4);	
*/

/*
void drawFreq(byte firmwareVersion){

    byte j;
    byte k;
	byte byteContainer[5];

	byte* data_ptr;

	word rawData[3];
    byte decodedData[9];

	rawData[0]=ReadMem(F_WORD,dataLocator[firmwareVersion][FREQ_A]);//

	byteContainer[0]=rawData[0];
	rawData[0]>>=8;
	byteContainer[1]|=rawData[0];

	for(j=0; j<2u; j++)
	{
		byteContainer[2]=byteContainer[0];

		byteContainer[2]&=0xF0;

		for(k=0u; k<=15u; k++)
		{
			if(byteCodepad[1][k]==byteContainer[2]){
				decodedData[j]=byteCodepad[0][k];
				break;
			}
		}
		
		byteContainer[0]<<=4;
	}

	decodedData[4]='\0';
			   	//             "<             max-length            >"
	printToScreen(0,0,(rom byte*)"CarrierFreq:                    ",2,4);
	data_ptr=decodedData;
	printToScreen(0,data_ptr,0,15,4);	
}
*/

/*

//below was a part of the early version of the MSP430 ProgD FW. Nowadays iam able to buffer the FW part to
//the local RAM without occupy memory for every SV-FW version.

//because i cannot overwrite a sigle byte in the flash without deleting a whole
//segment before, it is nessasary to backup the whole segment of the FW here.
//the important part (net id, segments an freq) can of course be modified before writing to
//flash. this procedure allows keeping the current FW and just modifying the user
//definable data. no matter what FW was on the component before.

// Backup of WN.RN.ER FW 2009
#pragma idata
//								0x0100,0x0008
const word data1[8]={0xA06A,0x0100,0x0008,0xF008,0xA0DA,0x0004,0x0012,0xA27E};
//								0x0902
const word data2[3]={0x3F79,0x0902,0xFF00};
const word data3[3]={0xA15C,0x0002,0x0012};
const word data4[4]={0xA280,0x3F79,0x0A01,0xFF00};
const word data5[2]={0xA04E,0x0001};
const word data6[4]={0x001A,0x0000,0x0000,0x0901};
const word data7[1]={0xA04E};
const word data8[4]={0x0002,0x001A,0x0C00,0xFF00};
const word data9[1]={0x0A02};
const word data10[4]={0xA04E,0x0003,0x001A,0x0A00};
const word data11[2]={0xFF00,0x0000};
const word data12[3]={0xA05C,0x0001,0x000E};
const word data13[4]={0x0A00,0xFF00,0x0000,0x0000};

// Backup of WN.LN.R FW 2007
//								0x0100,0x0008
const word data14[8]={0xA06A,0x0100,0x0008,0xF008,0xA0DA,0x0004,0x0012,0xA27E};
//								0x0902
const word data15[3]={0x3F79,0x0902,0xFF00};
const word data16[3]={0xA15C,0x0002,0x0012};
const word data17[4]={0xA280,0x3F79,0x0A01,0xFF00};
const word data18[2]={0xA04E,0x0001};
const word data19[4]={0x001A,0x0000,0x0000,0x0901};
const word data20[1]={0xA04E};
const word data21[4]={0x0002,0x001A,0x0C00,0xFF00};
const word data22[1]={0x0A02};
const word data23[4]={0xA04E,0x0003,0x001A,0x0A00};
const word data24[2]={0xFF00,0x0000};
const word data25[3]={0xA05C,0x0001,0x000E};
const word data26[4]={0x0A00,0xFF00,0x0000,0x0000};
*/


// This will store (or backup) up to 1024 bytes of the target firmware.
// This is because i cannot overwrite a sigle byte in the flash without deleting a whole
// segment before, it is nessasary to backup the whole segment of the FW here.
// the important part (net id, segments an freq) can of course be modified before writing to
// flash back. this procedure allows keeping the current FW and just modifying the user
// definable data. no matter what FW was on the component before.
/*
#pragma udata gpr1
 word firmwareData1[128];
 #pragma udata

#pragma udata gpr2
 word firmwareData2[128];
 #pragma udata

#pragma udata gpr3
 word firmwareData3[128];
 #pragma udata

#pragma udata gpr4 // out of 16 registers with 256 bytes each / or 128 words
 word firmwareData4[128];
 #pragma udata
*/